<?xml version="1.0" ?>
<net name="noise-suppression-poconetlike-0001" version="10">
	<layers>
		<layer id="0" name="inp_state_049" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 2, 129, 1"/>
			<output>
				<port id="0" names="inp_state_049" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>129</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="inp_state_048" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 2, 129, 4"/>
			<output>
				<port id="0" names="inp_state_048" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>129</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="inp_state_047" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 64, 129, 2"/>
			<output>
				<port id="0" names="inp_state_047" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>129</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="inp_state_046" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 48, 129, 2"/>
			<output>
				<port id="0" names="inp_state_046" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>129</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="inp_state_045" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 32, 129, 2"/>
			<output>
				<port id="0" names="inp_state_045" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>129</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="inp_state_044" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 64, 129, 2"/>
			<output>
				<port id="0" names="inp_state_044" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>129</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="inp_state_043" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 64, 32, 22"/>
			<output>
				<port id="0" names="inp_state_043" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>22</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="inp_state_042" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 64, 32, 22"/>
			<output>
				<port id="0" names="inp_state_042" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>22</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="inp_state_041" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 128, 64, 2"/>
			<output>
				<port id="0" names="inp_state_041" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="inp_state_040" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 96, 64, 2"/>
			<output>
				<port id="0" names="inp_state_040" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>64</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="inp_state_039" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 64, 64, 2"/>
			<output>
				<port id="0" names="inp_state_039" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="inp_state_038" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 128, 64, 2"/>
			<output>
				<port id="0" names="inp_state_038" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="inp_state_037" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 32, 64, 16"/>
			<output>
				<port id="0" names="inp_state_037" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="inp_state_036" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 32, 64, 16"/>
			<output>
				<port id="0" names="inp_state_036" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="inp_state_035" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 256, 32, 2"/>
			<output>
				<port id="0" names="inp_state_035" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="inp_state_034" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 192, 32, 2"/>
			<output>
				<port id="0" names="inp_state_034" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>32</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="inp_state_033" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 128, 32, 2"/>
			<output>
				<port id="0" names="inp_state_033" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="inp_state_032" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 256, 32, 2"/>
			<output>
				<port id="0" names="inp_state_032" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="inp_state_031" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 16, 128, 11"/>
			<output>
				<port id="0" names="inp_state_031" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>11</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="inp_state_030" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 16, 128, 11"/>
			<output>
				<port id="0" names="inp_state_030" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>11</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="inp_state_029" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 512, 16, 2"/>
			<output>
				<port id="0" names="inp_state_029" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="inp_state_028" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 384, 16, 2"/>
			<output>
				<port id="0" names="inp_state_028" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>16</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="inp_state_027" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 256, 16, 2"/>
			<output>
				<port id="0" names="inp_state_027" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>16</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="inp_state_026" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 512, 16, 2"/>
			<output>
				<port id="0" names="inp_state_026" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="inp_state_025" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 8, 256, 8"/>
			<output>
				<port id="0" names="inp_state_025" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="inp_state_024" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 8, 256, 8"/>
			<output>
				<port id="0" names="inp_state_024" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="inp_state_023" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 512, 8, 2"/>
			<output>
				<port id="0" names="inp_state_023" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="inp_state_021" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 256, 8, 2"/>
			<output>
				<port id="0" names="inp_state_021" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="inp_state_020" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 16, 256, 11"/>
			<output>
				<port id="0" names="inp_state_020" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>11</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="inp_state_019" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 16, 256, 11"/>
			<output>
				<port id="0" names="inp_state_019" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>11</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="inp_state_017" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 192, 16, 2"/>
			<output>
				<port id="0" names="inp_state_017" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>16</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="inp_state_016" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 128, 16, 2"/>
			<output>
				<port id="0" names="inp_state_016" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="inp_state_015" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 32, 128, 16"/>
			<output>
				<port id="0" names="inp_state_015" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="inp_state_014" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 32, 128, 16"/>
			<output>
				<port id="0" names="inp_state_014" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="inp_state_012" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 96, 32, 2"/>
			<output>
				<port id="0" names="inp_state_012" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>32</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="inp_state_011" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 64, 32, 2"/>
			<output>
				<port id="0" names="inp_state_011" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="inp_state_010" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 64, 64, 22"/>
			<output>
				<port id="0" names="inp_state_010" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>22</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="inp_state_009" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 64, 64, 22"/>
			<output>
				<port id="0" names="inp_state_009" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>22</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="inp_state_007" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 48, 64, 2"/>
			<output>
				<port id="0" names="inp_state_007" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>64</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="inp_state_006" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 32, 64, 2"/>
			<output>
				<port id="0" names="inp_state_006" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="inp_state_005" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 129, 32, 32"/>
			<output>
				<port id="0" names="inp_state_005" precision="FP32">
					<dim>1</dim>
					<dim>129</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="inp_state_004" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 129, 32, 32"/>
			<output>
				<port id="0" names="inp_state_004" precision="FP32">
					<dim>1</dim>
					<dim>129</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="inp_state_002" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 18, 129, 2"/>
			<output>
				<port id="0" names="inp_state_002" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>129</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="inp_state_001" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 2, 129, 2"/>
			<output>
				<port id="0" names="inp_state_001" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>129</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="input" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 2048"/>
			<output>
				<port id="0" names="input" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="inp_state_000" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 128"/>
			<output>
				<port id="0" names="inp_state_000" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="inp_state_003" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 34, 129, 2"/>
			<output>
				<port id="0" names="inp_state_003" precision="FP32">
					<dim>1</dim>
					<dim>34</dim>
					<dim>129</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="inp_state_008" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 64, 64, 2"/>
			<output>
				<port id="0" names="inp_state_008" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="inp_state_013" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 128, 32, 2"/>
			<output>
				<port id="0" names="inp_state_013" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="inp_state_018" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 256, 16, 2"/>
			<output>
				<port id="0" names="inp_state_018" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>16</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="inp_state_022" type="Parameter" version="opset1">
			<data element_type="f32" shape="1, 384, 8, 2"/>
			<output>
				<port id="0" names="inp_state_022" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>8</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Concat_0" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2048</dim>
				</port>
			</input>
			<output>
				<port id="2" names="337" precision="FP32">
					<dim>1</dim>
					<dim>2176</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Unsqueeze_12/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Unsqueeze_12/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2176</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="351" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2176</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Unsqueeze_13/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Unsqueeze_13/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2176</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="352" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>2176</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="_encdec_matrix140143" type="Const" version="opset1">
			<data element_type="f32" offset="16" shape="258, 1, 1, 256" size="264192"/>
			<output>
				<port id="0" names="_encdec_matrix" precision="FP32">
					<dim>258</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Conv_14" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="128, 128"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>2176</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>258</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" names="353" precision="FP32">
					<dim>1</dim>
					<dim>258</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Shape_15" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>258</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" names="354" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_16" type="Const" version="opset1">
			<data element_type="i32" offset="264208" shape="" size="4"/>
			<output>
				<port id="0" names="355" precision="I32"/>
			</output>
		</layer>
		<layer id="60" name="Gather_17/axis" type="Const" version="opset1">
			<data element_type="i64" offset="264212" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="61" name="Gather_173981" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="356" precision="I64"/>
			</output>
		</layer>
		<layer id="62" name="Unsqueeze_28/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="264212" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Unsqueeze_28/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="368" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="3174" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="1" size="8"/>
			<output>
				<port id="0" names="3174" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Shape_18" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>258</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" names="357" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_19" type="Const" version="opset1">
			<data element_type="i32" offset="264220" shape="" size="4"/>
			<output>
				<port id="0" names="358" precision="I32"/>
			</output>
		</layer>
		<layer id="67" name="Gather_20/axis" type="Const" version="opset1">
			<data element_type="i64" offset="264212" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="68" name="Gather_203827" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="359" precision="I64"/>
			</output>
		</layer>
		<layer id="69" name="Constant_24" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="" size="8"/>
			<output>
				<port id="0" names="363" precision="I64"/>
			</output>
		</layer>
		<layer id="70" name="Div_25" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" names="364,365,366" precision="I64"/>
			</output>
		</layer>
		<layer id="71" name="Unsqueeze_29/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="264212" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Unsqueeze_29/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="370" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Shape_21" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>258</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" names="360" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_22" type="Const" version="opset1">
			<data element_type="i32" offset="264224" shape="" size="4"/>
			<output>
				<port id="0" names="361" precision="I32"/>
			</output>
		</layer>
		<layer id="75" name="Gather_23/axis" type="Const" version="opset1">
			<data element_type="i64" offset="264212" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="76" name="Gather_233829" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="362" precision="I64"/>
			</output>
		</layer>
		<layer id="77" name="Unsqueeze_30/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="264212" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Unsqueeze_30/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="371" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Concat_31" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" names="372" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Reshape_32" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>258</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="373" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="data_mul_53966" type="Const" version="opset1">
			<data element_type="f32" offset="264228" shape="1, 2, 1, 1" size="8"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="BatchNormalization_33/mean/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="data_add_53968" type="Const" version="opset1">
			<data element_type="f32" offset="264236" shape="1, 2, 1, 1" size="8"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="BatchNormalization_33/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="374" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="LeakyRelu_34/weights90430140239" type="Const" version="opset1">
			<data element_type="f32" offset="264244" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="LeakyRelu_34" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="375" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Concat_35" type="Concat" version="opset1">
			<data axis="3"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>129</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" names="376" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>129</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="blocks_down.0.bd.0.conv.weight" type="Const" version="opset1">
			<data element_type="f32" offset="264248" shape="16, 2, 3, 3" size="1152"/>
			<output>
				<port id="0" names="blocks_down.0.bd.0.conv.weight" precision="FP32">
					<dim>16</dim>
					<dim>2</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Conv_62/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 0" pads_end="1, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>129</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>2</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Conv_62/Dims27508" type="Const" version="opset1">
			<data element_type="f32" offset="265400" shape="1, 16, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Conv_62" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="414" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Concat_63" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" names="415" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="data_mul_5397053974" type="Const" version="opset1">
			<data element_type="f32" offset="265464" shape="1, 18, 1, 1" size="72"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="BatchNormalization_64/mean/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="data_add_5397153976" type="Const" version="opset1">
			<data element_type="f32" offset="265536" shape="1, 18, 1, 1" size="72"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="BatchNormalization_64/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="416" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="LeakyRelu_65/weights90434141205" type="Const" version="opset1">
			<data element_type="f32" offset="264244" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="LeakyRelu_65" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="417" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Concat_66" type="Concat" version="opset1">
			<data axis="3"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>129</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" names="418" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>129</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="blocks_down.0.bd.1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" offset="265608" shape="16, 18, 3, 3" size="10368"/>
			<output>
				<port id="0" names="blocks_down.0.bd.1.conv.weight" precision="FP32">
					<dim>16</dim>
					<dim>18</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Conv_93/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 0" pads_end="1, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>129</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>18</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Conv_93/Dims27292" type="Const" version="opset1">
			<data element_type="f32" offset="275976" shape="1, 16, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Conv_93" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="456" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Concat_94" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>18</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" names="457" precision="FP32">
					<dim>1</dim>
					<dim>34</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="data_mul_5397853982" type="Const" version="opset1">
			<data element_type="f32" offset="276040" shape="1, 34, 1, 1" size="136"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>34</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="BatchNormalization_95/mean/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>34</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>34</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>34</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="data_add_5397953984" type="Const" version="opset1">
			<data element_type="f32" offset="276176" shape="1, 34, 1, 1" size="136"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>34</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="BatchNormalization_95/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>34</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>34</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="458" precision="FP32">
					<dim>1</dim>
					<dim>34</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="LeakyRelu_96/weights90510139789" type="Const" version="opset1">
			<data element_type="f32" offset="264244" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="LeakyRelu_96" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>34</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="459" precision="FP32">
					<dim>1</dim>
					<dim>34</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Concat_97" type="Concat" version="opset1">
			<data axis="3"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>34</dim>
					<dim>129</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>34</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" names="460" precision="FP32">
					<dim>1</dim>
					<dim>34</dim>
					<dim>129</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="blocks_down.0.bd_out.conv.weight" type="Const" version="opset1">
			<data element_type="f32" offset="276312" shape="32, 34, 3, 3" size="39168"/>
			<output>
				<port id="0" names="blocks_down.0.bd_out.conv.weight" precision="FP32">
					<dim>32</dim>
					<dim>34</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Conv_124/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 0" pads_end="1, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>34</dim>
					<dim>129</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>34</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Conv_124/Dims27454" type="Const" version="opset1">
			<data element_type="f32" offset="315480" shape="1, 32, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Conv_124" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="498" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="blocks_down.0.sa.linear_qkv.weight" type="Const" version="opset1">
			<data element_type="f32" offset="315608" shape="96, 32, 1, 1" size="12288"/>
			<output>
				<port id="0" names="blocks_down.0.sa.linear_qkv.weight" precision="FP32">
					<dim>96</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Conv_134/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Conv_134/Dims27472" type="Const" version="opset1">
			<data element_type="f32" offset="327896" shape="1, 96, 1, 1" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Conv_134" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="508" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="2838" type="Const" version="opset1">
			<data element_type="i64" offset="328280" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Transpose_135" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="509" precision="FP32">
					<dim>1</dim>
					<dim>129</dim>
					<dim>96</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Split_136/VariadicSplit_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="123" name="Split_136/VariadicSplit_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" offset="328312" shape="3" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Split_136/VariadicSplit" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>129</dim>
					<dim>96</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3" names="510" precision="FP32">
					<dim>1</dim>
					<dim>129</dim>
					<dim>32</dim>
					<dim>16</dim>
				</port>
				<port id="4" names="511" precision="FP32">
					<dim>1</dim>
					<dim>129</dim>
					<dim>32</dim>
					<dim>16</dim>
				</port>
				<port id="5" names="512" precision="FP32">
					<dim>1</dim>
					<dim>129</dim>
					<dim>32</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="Shape_125" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" names="499" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="Constant_126" type="Const" version="opset1">
			<data element_type="i32" offset="264208" shape="" size="4"/>
			<output>
				<port id="0" names="500" precision="I32"/>
			</output>
		</layer>
		<layer id="127" name="Gather_127/axis" type="Const" version="opset1">
			<data element_type="i64" offset="264212" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="128" name="Gather_1273879" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="501" precision="I64"/>
			</output>
		</layer>
		<layer id="129" name="Shape_131" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>129</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" names="505" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="Constant_132" type="Const" version="opset1">
			<data element_type="i32" offset="328336" shape="" size="4"/>
			<output>
				<port id="0" names="506" precision="I32"/>
			</output>
		</layer>
		<layer id="131" name="Gather_133/axis" type="Const" version="opset1">
			<data element_type="i64" offset="264212" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="132" name="Gather_1333993" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="507" precision="I64"/>
			</output>
		</layer>
		<layer id="133" name="Mul_167" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" names="547" precision="I64"/>
			</output>
		</layer>
		<layer id="134" name="Unsqueeze_168/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="264212" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="Unsqueeze_168/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="550" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="3195" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="0" names="3195" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="3196" type="Const" version="opset1">
			<data element_type="i64" offset="328340" shape="1" size="8"/>
			<output>
				<port id="0" names="3196" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="138" name="Shape_161" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>129</dim>
					<dim>32</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" names="541" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="139" name="Constant_162" type="Const" version="opset1">
			<data element_type="i32" offset="264224" shape="" size="4"/>
			<output>
				<port id="0" names="542" precision="I32"/>
			</output>
		</layer>
		<layer id="140" name="Gather_163/axis" type="Const" version="opset1">
			<data element_type="i64" offset="264212" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="141" name="Gather_1633945" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="543" precision="I64"/>
			</output>
		</layer>
		<layer id="142" name="Unsqueeze_169/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="264212" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="143" name="Unsqueeze_169/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="553" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="144" name="Concat_170" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" names="554" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="145" name="Reshape_171" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>129</dim>
					<dim>32</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
